Ran Plan for 5 projects:

1. project: `main-us-east-1-iam` dir: `live/main-account/us-east-1/iam` workspace: `default`
1. project: `main-us-east-1-s3-central-data` dir: `live/main-account/us-east-1/s3-central-data` workspace: `default`
1. project: `secondary-us-west-2-shared-storage` dir: `live/secondary-account/us-west-2/shared-storage` workspace: `default`
1. project: `main-us-east-1-shared-storage` dir: `live/main-account/us-east-1/shared-storage` workspace: `default`
1. project: `main-us-west-2-shared-storage` dir: `live/main-account/us-west-2/shared-storage` workspace: `default`
---

### 1. project: `main-us-east-1-iam` dir: `live/main-account/us-east-1/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
02:59:04.893 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
02:59:04.925 INFO   Downloading Terraform configurations from ../../../../modules/iam into ./.terragrunt-cache/vJGLQ9RqPZPr6EqSoLiA6dF2D1U/eFsy4zZRoNlYMOuISuihGkL2kxQ
02:59:04.959 INFO   terraform: Initializing the backend...
02:59:05.060 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
02:59:05.060 INFO   terraform: use this backend unless the backend configuration changes.
02:59:05.115 INFO   terraform: Initializing provider plugins...
02:59:05.115 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
02:59:05.230 INFO   terraform: - Installing hashicorp/aws v6.34.0...
02:59:13.074 INFO   terraform: - Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
02:59:13.074 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
02:59:13.074 INFO   terraform: selections it made above. Include this file in your version control repository
02:59:13.074 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
02:59:13.074 INFO   terraform: you run "terraform init" in the future.
02:59:13.075 INFO   terraform: Terraform has been successfully initialized!
02:59:13.075 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
02:59:13.075 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
02:59:13.075 INFO   terraform: should now work.
02:59:13.075 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
02:59:13.075 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
02:59:13.075 INFO   terraform: commands will detect it and remind you to do so if necessary.
02:59:18.476 STDOUT terraform: data.aws_iam_policy_document.parallelcluster_compute[0]: Reading...
02:59:18.476 STDOUT terraform: data.aws_iam_policy_document.ec2_assume_role[0]: Reading...
02:59:18.476 STDOUT terraform: data.aws_iam_policy_document.parallelcluster_head_node[0]: Reading...
02:59:18.476 STDOUT terraform: data.aws_caller_identity.current: Reading...
02:59:18.479 STDOUT terraform: data.aws_iam_policy_document.parallelcluster_compute[0]: Read complete after 0s [id=562196291]
02:59:18.479 STDOUT terraform: data.aws_iam_policy_document.ec2_assume_role[0]: Read complete after 0s [id=2851119427]
02:59:18.480 STDOUT terraform: data.aws_iam_policy_document.parallelcluster_head_node[0]: Read complete after 0s [id=1506239419]
02:59:18.482 STDOUT terraform: aws_iam_role.parallelcluster_compute[0]: Refreshing state... [id=ParallelClusterComputeRole]
02:59:18.483 STDOUT terraform: aws_iam_role.parallelcluster_head_node[0]: Refreshing state... [id=ParallelClusterHeadNodeRole]
02:59:18.483 STDOUT terraform: data.aws_caller_identity.current: Read complete after 0s [id=483026362307]
02:59:18.486 STDOUT terraform: data.aws_iam_policy_document.terraform_execution_assume_role[0]: Reading...
02:59:18.488 STDOUT terraform: data.aws_iam_policy_document.kms_key_policy: Reading...
02:59:18.488 STDOUT terraform: data.aws_iam_policy_document.terraform_execution_assume_role[0]: Read complete after 0s [id=2799187551]
02:59:18.491 STDOUT terraform: data.aws_iam_policy_document.kms_key_policy: Read complete after 0s [id=3686458410]
02:59:18.492 STDOUT terraform: aws_iam_role.terraform_execution[0]: Refreshing state... [id=TerraformExecutionRole]
02:59:18.494 STDOUT terraform: aws_kms_key.shared: Refreshing state... [id=d0cb5257-55a2-4607-a96b-e51e92d19ea7]
02:59:18.544 STDOUT terraform: aws_kms_alias.shared: Refreshing state... [id=alias/ml-main-us-east-1]
02:59:18.601 STDOUT terraform: aws_iam_role_policy_attachment.terraform_execution_admin[0]: Refreshing state... [id=TerraformExecutionRole/arn:aws:iam::aws:policy/AdministratorAccess]
02:59:18.601 STDOUT terraform: aws_iam_role_policy.parallelcluster_compute[0]: Refreshing state... [id=ParallelClusterComputeRole:ParallelClusterComputePolicy]
02:59:18.631 STDOUT terraform: aws_iam_role_policy_attachment.parallelcluster_head_node_ssm[0]: Refreshing state... [id=ParallelClusterHeadNodeRole/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
02:59:18.632 STDOUT terraform: aws_iam_role_policy.parallelcluster_head_node[0]: Refreshing state... [id=ParallelClusterHeadNodeRole:ParallelClusterHeadNodePolicy]
02:59:18.837 STDOUT terraform: No changes. Your infrastructure matches the configuration.
02:59:18.837 STDOUT terraform: Terraform has compared your real infrastructure against your configuration
02:59:18.837 STDOUT terraform: and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p main-us-east-1-iam
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fmain-account%252Fus-east-1%252Fiam%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p main-us-east-1-iam
  ```
No changes. Your infrastructure matches the configuration.

---
### 2. project: `main-us-east-1-s3-central-data` dir: `live/main-account/us-east-1/s3-central-data` workspace: `default`
<details><summary>Show Output</summary>

```diff
02:59:19.526 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
02:59:19.556 INFO   Downloading Terraform configurations from ../../../../modules/s3-data-bucket into ./.terragrunt-cache/VVMfT755YW4U5XrSzSCTtZLCocQ/tiO_R2UPsZPvNPABg9Xtap2TwiU
02:59:19.586 INFO   terraform: Initializing the backend...
02:59:19.719 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
02:59:19.719 INFO   terraform: use this backend unless the backend configuration changes.
02:59:19.769 INFO   terraform: Initializing provider plugins...
02:59:19.770 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
02:59:19.870 INFO   terraform: - Installing hashicorp/aws v6.34.0...
02:59:27.472 INFO   terraform: - Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
02:59:27.472 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
02:59:27.472 INFO   terraform: selections it made above. Include this file in your version control repository
02:59:27.472 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
02:59:27.472 INFO   terraform: you run "terraform init" in the future.
02:59:27.473 INFO   terraform: Terraform has been successfully initialized!
02:59:27.473 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
02:59:27.473 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
02:59:27.473 INFO   terraform: should now work.
02:59:27.473 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
02:59:27.473 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
02:59:27.473 INFO   terraform: commands will detect it and remind you to do so if necessary.
02:59:32.818 STDOUT terraform: aws_s3_bucket.this: Refreshing state... [id=ml-data-central-483026362307-us-east-1]
02:59:33.066 STDOUT terraform: aws_s3_bucket_versioning.this: Refreshing state... [id=ml-data-central-483026362307-us-east-1]
02:59:33.066 STDOUT terraform: aws_s3_bucket_public_access_block.this: Refreshing state... [id=ml-data-central-483026362307-us-east-1]
02:59:33.066 STDOUT terraform: aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=ml-data-central-483026362307-us-east-1]
02:59:33.067 STDOUT terraform: data.aws_iam_policy_document.bucket_policy: Reading...
02:59:33.070 STDOUT terraform: data.aws_iam_policy_document.bucket_policy: Read complete after 0s [id=1828846250]
02:59:33.077 STDOUT terraform: aws_s3_bucket_policy.this: Refreshing state... [id=ml-data-central-483026362307-us-east-1]
02:59:34.307 STDOUT terraform: aws_s3_bucket_lifecycle_configuration.this: Refreshing state... [id=ml-data-central-483026362307-us-east-1]
02:59:35.100 STDOUT terraform: No changes. Your infrastructure matches the configuration.
02:59:35.101 STDOUT terraform: Terraform has compared your real infrastructure against your configuration
02:59:35.101 STDOUT terraform: and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p main-us-east-1-s3-central-data
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fmain-account%252Fus-east-1%252Fs3-central-data%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p main-us-east-1-s3-central-data
  ```
No changes. Your infrastructure matches the configuration.

---
### 3. project: `secondary-us-west-2-shared-storage` dir: `live/secondary-account/us-west-2/shared-storage` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/extra-bin/terragrunt plan -no-color -out=$PLANFILE' in '/atlantis-data/repos/KeitaW/ml-clusters/13/default/live/secondary-account/us-west-2/shared-storage': exit status 1: running "/extra-bin/terragrunt plan -no-color -out=$PLANFILE" in "/atlantis-data/repos/KeitaW/ml-clusters/13/default/live/secondary-account/us-west-2/shared-storage": 
02:59:35.833 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
02:59:36.373 WARN   Config ../networking/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
02:59:36.378 WARN   Config ../s3-data-replica/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
02:59:36.391 INFO   Downloading Terraform configurations from ../../../../modules/shared-storage into ./.terragrunt-cache/G-Y9e9NiskJZjVBJABCtg0iLKqg/2SWKpKeJ5VExDf3DdyQJzHsN7mY
02:59:36.455 INFO   terraform: Initializing the backend...
02:59:36.577 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
02:59:36.577 INFO   terraform: use this backend unless the backend configuration changes.
02:59:36.605 INFO   terraform: Initializing provider plugins...
02:59:36.605 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
02:59:36.705 INFO   terraform: - Installing hashicorp/aws v6.34.0...
02:59:54.710 INFO   terraform: - Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
02:59:54.710 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
02:59:54.710 INFO   terraform: selections it made above. Include this file in your version control repository
02:59:54.710 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
02:59:54.710 INFO   terraform: you run "terraform init" in the future.
02:59:54.711 INFO   terraform: Terraform has been successfully initialized!
02:59:54.711 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
02:59:54.711 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
02:59:54.711 INFO   terraform: should now work.
02:59:54.711 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
02:59:54.711 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
02:59:54.711 INFO   terraform: commands will detect it and remind you to do so if necessary.
03:00:02.570 STDOUT terraform: data.aws_vpc.selected: Reading...
03:00:03.129 STDOUT terraform: Terraform used the selected providers to generate the following execution
03:00:03.129 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
03:00:03.129 STDOUT terraform:   + create
03:00:03.129 STDOUT terraform: Terraform planned the following actions, but then encountered a problem:
03:00:03.129 STDOUT terraform:   # aws_efs_access_point.home will be created
03:00:03.129 STDOUT terraform:   + resource "aws_efs_access_point" "home" {
03:00:03.129 STDOUT terraform:       + arn             = (known after apply)
03:00:03.129 STDOUT terraform:       + file_system_arn = (known after apply)
03:00:03.129 STDOUT terraform:       + file_system_id  = (known after apply)
03:00:03.129 STDOUT terraform:       + id              = (known after apply)
03:00:03.130 STDOUT terraform:       + owner_id        = (known after apply)
03:00:03.130 STDOUT terraform:       + region          = "us-west-2"
03:00:03.130 STDOUT terraform:       + tags            = {
03:00:03.130 STDOUT terraform:           + "Name" = "ml-efs-home-secondary-us-west-2"
03:00:03.130 STDOUT terraform:         }
03:00:03.130 STDOUT terraform:       + tags_all        = {
03:00:03.130 STDOUT terraform:           + "Account"    = "secondary"
03:00:03.130 STDOUT terraform:           + "ManagedBy"  = "terraform"
03:00:03.130 STDOUT terraform:           + "Name"       = "ml-efs-home-secondary-us-west-2"
03:00:03.130 STDOUT terraform:           + "Region"     = "us-west-2"
03:00:03.130 STDOUT terraform:           + "Repository" = "ml-clusters"
03:00:03.130 STDOUT terraform:         }
03:00:03.130 STDOUT terraform:       + root_directory {
03:00:03.130 STDOUT terraform:           + path = "/home"
03:00:03.130 STDOUT terraform:           + creation_info {
03:00:03.130 STDOUT terraform:               + owner_gid   = 1000
03:00:03.130 STDOUT terraform:               + owner_uid   = 1000
03:00:03.130 STDOUT terraform:               + permissions = "755"
03:00:03.130 STDOUT terraform:             }
03:00:03.130 STDOUT terraform:         }
03:00:03.130 STDOUT terraform:     }
03:00:03.130 STDOUT terraform:   # aws_efs_file_system.main will be created
03:00:03.130 STDOUT terraform:   + resource "aws_efs_file_system" "main" {
03:00:03.130 STDOUT terraform:       + arn                     = (known after apply)
03:00:03.130 STDOUT terraform:       + availability_zone_id    = (known after apply)
03:00:03.130 STDOUT terraform:       + availability_zone_name  = (known after apply)
03:00:03.131 STDOUT terraform:       + creation_token          = (known after apply)
03:00:03.131 STDOUT terraform:       + dns_name                = (known after apply)
03:00:03.131 STDOUT terraform:       + encrypted               = true
03:00:03.131 STDOUT terraform:       + id                      = (known after apply)
03:00:03.131 STDOUT terraform:       + kms_key_id              = (known after apply)
03:00:03.131 STDOUT terraform:       + name                    = (known after apply)
03:00:03.131 STDOUT terraform:       + number_of_mount_targets = (known after apply)
03:00:03.131 STDOUT terraform:       + owner_id                = (known after apply)
03:00:03.131 STDOUT terraform:       + performance_mode        = "generalPurpose"
03:00:03.131 STDOUT terraform:       + region                  = "us-west-2"
03:00:03.131 STDOUT terraform:       + size_in_bytes           = (known after apply)
03:00:03.131 STDOUT terraform:       + tags                    = {
03:00:03.131 STDOUT terraform:           + "Name" = "ml-efs-secondary-us-west-2"
03:00:03.131 STDOUT terraform:         }
03:00:03.131 STDOUT terraform:       + tags_all                = {
03:00:03.131 STDOUT terraform:           + "Account"    = "secondary"
03:00:03.131 STDOUT terraform:           + "ManagedBy"  = "terraform"
03:00:03.131 STDOUT terraform:           + "Name"       = "ml-efs-secondary-us-west-2"
03:00:03.132 STDOUT terraform:           + "Region"     = "us-west-2"
03:00:03.132 STDOUT terraform:           + "Repository" = "ml-clusters"
03:00:03.132 STDOUT terraform:         }
03:00:03.132 STDOUT terraform:       + throughput_mode         = "elastic"
03:00:03.132 STDOUT terraform:       + protection (known after apply)
03:00:03.132 STDOUT terraform:     }
03:00:03.132 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
03:00:03.132 STDOUT terraform: Changes to Outputs:
03:00:03.132 STDOUT terraform:   + efs_access_point_id = (known after apply)
03:00:03.132 STDOUT terraform:   + efs_filesystem_arn  = (known after apply)
03:00:03.132 STDOUT terraform:   + efs_filesystem_id   = (known after apply)
03:00:03.132 STDERR terraform: Error: no matching EC2 VPC found
03:00:03.132 STDERR terraform:   with data.aws_vpc.selected,
03:00:03.133 STDERR terraform:   on main.tf line 5, in data "aws_vpc" "selected":
03:00:03.133 STDERR terraform:    5: data "aws_vpc" "selected" {
03:00:03.215 ERROR  error occurred:

* Failed to execute "terraform plan -out=./secondary-us-west-2-shared-storage-default.tfplan -no-color" in ./.terragrunt-cache/G-Y9e9NiskJZjVBJABCtg0iLKqg/2SWKpKeJ5VExDf3DdyQJzHsN7mY
  
  Error: no matching EC2 VPC found
  
    with data.aws_vpc.selected,
    on main.tf line 5, in data "aws_vpc" "selected":
     5: data "aws_vpc" "selected" {
  
  
  exit status 1



```
</details>

---
### 4. project: `main-us-east-1-shared-storage` dir: `live/main-account/us-east-1/shared-storage` workspace: `default`
<details><summary>Show Output</summary>

```diff
02:59:35.974 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
03:00:00.127 INFO   Downloading Terraform configurations from ../../../../modules/shared-storage into ./.terragrunt-cache/2VF0hoBsAtdBgk2co2_yitdagCs/2SWKpKeJ5VExDf3DdyQJzHsN7mY
03:00:00.182 INFO   terraform: Initializing the backend...
03:00:00.280 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
03:00:00.280 INFO   terraform: use this backend unless the backend configuration changes.
03:00:00.355 INFO   terraform: Initializing provider plugins...
03:00:00.355 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
03:00:00.454 INFO   terraform: - Installing hashicorp/aws v6.34.0...
03:00:09.830 INFO   terraform: - Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
03:00:09.830 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
03:00:09.830 INFO   terraform: selections it made above. Include this file in your version control repository
03:00:09.831 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
03:00:09.831 INFO   terraform: you run "terraform init" in the future.
03:00:09.831 INFO   terraform: Terraform has been successfully initialized!
03:00:09.831 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
03:00:09.831 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
03:00:09.831 INFO   terraform: should now work.
03:00:09.831 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
03:00:09.831 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
03:00:09.831 INFO   terraform: commands will detect it and remind you to do so if necessary.
03:00:15.946 STDOUT terraform: data.aws_vpc.selected: Reading...
03:00:15.947 STDOUT terraform: aws_efs_file_system.main: Refreshing state... [id=fs-00d4389c0979f4954]
03:00:16.130 STDOUT terraform: aws_efs_access_point.home: Refreshing state... [id=fsap-0ce2e9bee7e5d1fbe]
03:00:16.259 STDOUT terraform: data.aws_vpc.selected: Read complete after 0s [id=vpc-02809940b6e2aa557]
03:00:16.263 STDOUT terraform: aws_security_group.efs: Refreshing state... [id=sg-01b603ffe783deeb3]
03:00:16.264 STDOUT terraform: aws_security_group.fsx: Refreshing state... [id=sg-007d5fb83c16b859e]
03:00:16.340 STDOUT terraform: aws_efs_mount_target.main["subnet-0d23000c7357fa612"]: Refreshing state... [id=fsmt-0804d48339a4cf2d9]
03:00:16.340 STDOUT terraform: aws_efs_mount_target.main["subnet-0f4105bb59e3c0e39"]: Refreshing state... [id=fsmt-05e0b00facef9db3d]
03:00:16.361 STDOUT terraform: aws_fsx_lustre_file_system.main: Refreshing state... [id=fs-0c9dd7f6c762728e3]
03:00:16.832 STDOUT terraform: aws_fsx_data_repository_association.main: Refreshing state... [id=dra-051df5bfbd54e9f0e]
03:00:17.251 STDOUT terraform: No changes. Your infrastructure matches the configuration.
03:00:17.251 STDOUT terraform: Terraform has compared your real infrastructure against your configuration
03:00:17.251 STDOUT terraform: and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p main-us-east-1-shared-storage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fmain-account%252Fus-east-1%252Fshared-storage%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p main-us-east-1-shared-storage
  ```
No changes. Your infrastructure matches the configuration.

---
### 5. project: `main-us-west-2-shared-storage` dir: `live/main-account/us-west-2/shared-storage` workspace: `default`
<details><summary>Show Output</summary>

```diff
02:59:35.864 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
02:59:59.985 INFO   Downloading Terraform configurations from ../../../../modules/shared-storage into ./.terragrunt-cache/3hS9h5UBQbBWbUvgdigi5YbcRB4/2SWKpKeJ5VExDf3DdyQJzHsN7mY
03:00:00.047 INFO   terraform: Initializing the backend...
03:00:00.151 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
03:00:00.151 INFO   terraform: use this backend unless the backend configuration changes.
03:00:00.204 INFO   terraform: Initializing provider plugins...
03:00:00.204 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
03:00:00.311 INFO   terraform: - Installing hashicorp/aws v6.34.0...
03:00:09.195 INFO   terraform: - Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
03:00:09.195 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
03:00:09.195 INFO   terraform: selections it made above. Include this file in your version control repository
03:00:09.195 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
03:00:09.195 INFO   terraform: you run "terraform init" in the future.
03:00:09.195 INFO   terraform: Terraform has been successfully initialized!
03:00:09.196 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
03:00:09.196 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
03:00:09.196 INFO   terraform: should now work.
03:00:09.196 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
03:00:09.196 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
03:00:09.196 INFO   terraform: commands will detect it and remind you to do so if necessary.
03:00:15.972 STDOUT terraform: data.aws_vpc.selected: Reading...
03:00:15.973 STDOUT terraform: aws_efs_file_system.main: Refreshing state... [id=fs-0b7482cc30d28cd94]
03:00:16.327 STDOUT terraform: aws_efs_access_point.home: Refreshing state... [id=fsap-0cca2c93d38685c60]
03:00:16.676 STDOUT terraform: data.aws_vpc.selected: Read complete after 1s [id=vpc-09eeb03d16d18dd14]
03:00:16.679 STDOUT terraform: aws_security_group.efs: Refreshing state... [id=sg-0fe7f06e366de56b9]
03:00:16.680 STDOUT terraform: aws_security_group.fsx: Refreshing state... [id=sg-053a6ddee2f0048d5]
03:00:16.798 STDOUT terraform: aws_efs_mount_target.main["subnet-0938543da241bcf71"]: Refreshing state... [id=fsmt-0036ec1283021f179]
03:00:16.798 STDOUT terraform: aws_efs_mount_target.main["subnet-048e81d5a55315452"]: Refreshing state... [id=fsmt-0fe25cff3fae7422d]
03:00:16.905 STDOUT terraform: aws_fsx_lustre_file_system.main: Refreshing state... [id=fs-08179052b2e5c309f]
03:00:17.365 STDOUT terraform: aws_fsx_data_repository_association.main: Refreshing state... [id=dra-01f0b74bf06f92f99]
03:00:17.798 STDOUT terraform: No changes. Your infrastructure matches the configuration.
03:00:17.798 STDOUT terraform: Terraform has compared your real infrastructure against your configuration
03:00:17.798 STDOUT terraform: and found no differences, so no changes are needed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p main-us-west-2-shared-storage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fmain-account%252Fus-west-2%252Fshared-storage%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p main-us-west-2-shared-storage
  ```
No changes. Your infrastructure matches the configuration.

---
### Plan Summary

5 projects, 0 with changes, 4 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```